In [8]:
import pandas as pd
df1 =pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore','Tamil Nadu'],
    'temperature':[32,38,30,35],
    
})
df1

         city  temperature
0      Mumbai           32
1       Delhi           38
2   Bangalore           30
3  Tamil Nadu           35

In [6]:
df2= pd.DataFrame({
     'city':['Mumbai','Delhi','Bangalore'],
    'humidity':[80,60,78]
})
df2

        city  humidity
0     Mumbai        80
1      Delhi        60
2  Bangalore        78

In [9]:
df3 =pd.merge(df1,df2,on="city")
df3

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           38        60
2  Bangalore           30        78

In [10]:
df3 =pd.merge(df1,df2,on="city",how="outer")
df3

         city  temperature  humidity
0      Mumbai           32      80.0
1       Delhi           38      60.0
2   Bangalore           30      78.0
3  Tamil Nadu           35       NaN

In [11]:
df3 =pd.merge(df1,df2,on="city",how="outer", indicator="True")
df3

         city  temperature  humidity       True
0      Mumbai           32      80.0       both
1       Delhi           38      60.0       both
2   Bangalore           30      78.0       both
3  Tamil Nadu           35       NaN  left_only

In [14]:
df1 =pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore','Tamil Nadu'],
    'temperature':[32,38,30,35],
    
})
df2 =pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore','Tamil Nadu'],
    'temperature':[20,30,40,42],
    
})
df3=pd.merge(df1,df2,on="city",suffixes=('_left','_right'))
df3

         city  temperature_left  temperature_right
0      Mumbai                32                 20
1       Delhi                38                 30
2   Bangalore                30                 40
3  Tamil Nadu                35                 42